---
kind: type
id: T:Autodesk.Revit.UI.ContextualHelpType
source: html/e69d3100-719b-7be4-9580-563207d68439.htm
---
# Autodesk.Revit.UI.ContextualHelpType

Represents the contextual help type.

## Syntax (C#)
```csharp
public enum ContextualHelpType
```